import hatowa

class Japtohan:
    def __init__(self):

        self.jap_one_syl = ["あ", "か", "さ", "た", "な", "は", "ま", "や", "ら", "わ", "が", "ざ", "だ", "ば", "ぱ",
                            "い", "き", "し", "ち", "に", "ひ", "み", "り", "ぎ", "じ", "ぢ", "び", "ぴ",
                            "う", "く", "す", "つ", "ぬ", "ふ", "む", "ゆ", "る", "ぐ", "ず", "づ", "ぶ", "ぷ",
                            "え", "け", "せ", "て", "ね", "へ", "め", "れ", "げ", "ぜ", "で", "べ", "ぺ",
                            "お", "こ", "そ", "と", "の", "ほ", "も", "よ", "ろ", "ご", "ぞ", "ど", "ぼ", "ぽ", "を", " ","ゔ","っ"]
        self.jap_two_syl = ["きゃ", "しゃ", "ちゃ", "にゃ", "ひゃ", "みゃ", "りゃ", "ぎゃ", "じゃ", "びゃ", "ぴゃ",
                            "きゅ", "しゅ", "ちゅ", "にゅ", "ひゅ", "みゅ", "りゅ", "ぎゅ", "じゅ", "びゅ", "ぴゅ",
                            "きょ", "しょ", "ちょ", "にょ", "ひょ", "みょ", "りょ", "ぎょ", "じょ", "びょ", "ぴょ",
                            "あっ", "かっ", "さっ", "たっ", "なっ", "はっ", "まっ", "やっ", "らっ", "わっ", "がっ", "ざっ", "だっ", "ばっ", "ぱっ",
                            "いっ", "きっ", "しっ", "ちっ", "にっ", "ひっ", "みっ", "りっ", "ぎっ", "じっ", "ぢっ", "びっ", "ぴっ",
                            "うっ", "くっ", "すっ", "つっ", "ぬっ", "ふっ", "むっ", "ゆっ", "るっ", "ぐっ", "ずっ", "づっ", "ぶっ", "ぷっ",
                            "えっ", "けっ", "せっ", "てっ", "ねっ", "へっ", "めっ", "れっ", "げっ", "ぜっ", "でっ", "べっ", "ぺっ",
                            "おっ", "こっ", "そっ", "とっ", "のっ", "ほっ", "もっ", "よっ", "ろっ", "ごっ", "ぞっ", "どっ", "ぼっ", "ぽっ",
                            "あん", "かん", "さん", "たん", "なん", "はん", "まん", "やん", "らん", "わん", "がん", "ざん", "だん", "ばん", "ぱん",
                            "いん", "きん", "しん", "ちん", "にん", "ひん", "みん", "りん", "ぎん", "じん", "ぢん", "びん", "ぴん",
                            "うん", "くん", "すん", "つん", "ぬん", "ふん", "むん", "ゆん", "るん", "ぐん", "ずん", "づん", "ぶん", "ぷん",
                            "えん", "けん", "せん", "てん", "ねん", "へん", "めん", "れん", "げん", "ぜん", "でん", "べん", "ぺん",
                            "おん", "こん", "そん", "とん", "のん", "ほん", "もん", "よん", "ろん", "ごん", "ぞん", "どん", "ぼん", "ぽん",
                            "しぇ", "ふぁ", "ふぃ", "ふぇ", "ふぉ", "うぃ", "うぇ", "うぉ", "つぁ", "つぃ", "つぇ", "つぉ",
                            "ちぇ", "くぁ", "くぃ", "くぇ", "くぉ", "とぅ", "でゅ",
                            "ゔぁ","まぁ",
                            "でぃ", "ねぇ", "なぁ", "$は", "あぁ", "ふぃ","じぇ","とぅ","てぃ","ふぇ","わっ","ぁっ"]
        self.jap_three_syl = ["きゃっ", "しゃっ", "ちゃっ", "にゃっ", "ひゃっ", "みゃっ", "りゃっ", "ぎゃっ", "じゃっ", "びゃっ", "ぴゃっ",
                            "きゅっ", "しゅっ", "ちゅっ", "にゅっ", "ひゅっ", "みゅっ", "りゅっ", "ぎゅっ", "じゅっ", "びゅっ", "ぴゅっ",
                            "きょっ", "しょっ", "ちょっ", "にょっ", "ひょっ", "みょっ", "りょっ", "ぎょっ", "じょっ", "びょっ", "ぴょっ",
                            "きゃん", "しゃん", "ちゃん", "にゃん", "ひゃん", "みゃん", "りゃん", "ぎゃん", "じゃん", "びゃん", "ぴゃん",
                            "きゅん", "しゅん", "ちゅん", "にゅん", "ひゅん", "みゅん", "りゅん", "ぎゅん", "じゅん", "びゅん", "ぴゅん",
                            "きょん", "しょん", "ちょん", "にょん", "ひょん", "みょん", "りょん", "ぎょん", "じょん", "びょん", "ぴょん", ]

        self.kor_one_syl = ["아", "카", "사", "타", "나", "하", "마", "야", "라", "와", "가", "자", "다", "바", "파",
                            "이", "키", "시", "찌", "니", "히", "미", "리", "기", "지", "지", "비", "피",
                            "우", "쿠", "스", "쯔", "누", "후", "무", "유", "루", "구", "즈", "즈", "부", "푸",
                            "에", "케", "세", "테", "네", "헤", "메", "레", "게", "제", "데", "베", "페",
                            "오", "코", "소", "토", "노", "호", "모", "요", "로", "고", "조", "도", "보", "포", "오", " ", "부","ㅅ"]
        self.kor_two_syl = ["캬", "샤", "챠", "냐", "햐", "먀", "랴", "갸", "쟈", "뱌", "퍄",
                            "큐", "슈", "츄", "뉴", "휴", "뮤", "류", "규", "쥬", "뷰", "퓨",
                            "쿄", "쇼", "쵸", "뇨", "효", "묘", "료", "교", "죠", "뵤", "표",
                            "앗", "캇", "삿", "탓", "낫", "핫", "맛", "얏", "랏", "왓", "갓", "잣", "닷", "밧", "팟",
                            "잇", "킷", "싯", "칫", "닛", "힛", "밋", "릿", "깃", "짓", "짓", "빗", "핏",
                            "웃", "쿳", "슷", "쯧", "눗", "훗", "뭇", "윳", "룻", "굿", "즛", "즛", "붓", "풋",
                            "엣", "켓", "셋", "텟", "넷", "헷", "멧", "렛", "겟", "젯", "뎃", "벳", "펫",
                            "옷", "콧", "솟", "톳", "놋", "홋", "못", "욧", "롯", "곳", "좃", "돗", "봇", "폿",
                            "안", "칸", "산", "탄", "난", "한", "만", "얀", "란", "완", "간", "잔", "단", "반", "판",
                            "인", "킨", "신", "찐", "닌", "힌", "민", "린", "긴", "진", "진", "빈", "핀",
                            "운", "쿤", "슨", "쯘", "는", "훈", "문", "윤", "룬", "군", "즌", "즌", "분", "푼",
                            "엔", "켄", "센", "텐", "넨", "헨", "멘", "렌", "겐", "젠", "덴", "벤", "펜",
                            "온", "콘", "손", "톤", "논", "혼", "몬", "욘", "론", "곤", "존", "돈", "본", "폰",
                            "쉐", "화", "휘", "훼", "훠", "위", "웨", "워", "촤", "취", "췌", "춰",
                            "체", "콰", "퀴", "퀘", "쿼", "투", "듀",
                            "봐", "마아",
                            "디", "네-", "나-", "와", "아-", "휘","제","투","티","페","왓","앗"]
        self.kor_three_syl = ["캿", "샷", "챳", "냣", "햣", "먓", "럇", "걋", "쟛", "뱟", "퍗",
                            "큣", "슛", "츗", "늇", "흇", "뮷", "륫", "귯", "쥿", "븃", "퓻",
                            "쿗", "숏", "춋", "뇻", "횻", "묫", "룟", "굣", "죳", "뵷", "푯",
                            "캰", "샨", "챤", "냔", "햔", "먄", "랸", "갼", "쟌", "뱐", "퍈",
                            "큔", "슌", "츈", "뉸", "휸", "뮨", "륜", "균", "쥰", "뷴", "퓬",
                            "쿈", "숀", "쵼", "뇬", "횬", "묜", "룐", "굔", "죤", "뵨", "푠", ]

    def furitohan_list(self, lines:list=[]):

        # line = ["くものようなやさしさでそっとぎゅっと"] # Sample

        res = []
        for line in lines:
            for idx, item in enumerate(self.jap_three_syl):
                line = line.replace(item, self.kor_three_syl[idx])
            for idx, item in enumerate(self.jap_two_syl):
                line = line.replace(item, self.kor_two_syl[idx])
            for idx, item in enumerate(self.jap_one_syl):
                line = line.replace(item, self.kor_one_syl[idx])
            res.append(line)

        # print(res)

        return res


    def furitohan_str(self, line:str=""):

        # line = "くものようなやさしさでそっとぎゅっと" # Sample

        for idx, item in enumerate(self.jap_three_syl):
            line = line.replace(item, self.kor_three_syl[idx])
        for idx, item in enumerate(self.jap_two_syl):
            line = line.replace(item, self.kor_two_syl[idx])
        for idx, item in enumerate(self.jap_one_syl):
            line = line.replace(item, self.kor_one_syl[idx])

        # print(line)

        return line

# lyrics = '''
# ながいながいみちをしたって$$$$$くらいくらいかわをわたって$$$$$こまいこまいろじをぬけて$$$$$きみをたすけにきた$$$$$やっとたどりついた$$$$$ようやくきみとあえた$$$$$なのにきみ$はいうんだ$$$$$こんやがさいごだと$$$$$どうかあけないで$$$$$まだもっとそばにいたい$$$$$どうかいかないで$$$$$あさなんてこなけ
# ればいい$$$$$あしたのあさがこれば$$$$$きみ$はいってしまう$$$$$はるかとおいところ$$$$$もうあえないところ$$$$$なにもかもすててぼくと$$$$$いっしょににげようと$$$$$そういっててをにぎったら$$$$$ありがとうってわらったね$$$$$どうかあけないで$$$$$まだもっとそばにいたい$$$$$どうかいかないで$$$$$あさなんて
# こなければいい$$$$$ながいながいみちをしたって$$$$$くらいくらいかわをわたって$$$$$こまいこまいろじをぬけて$$$$$きみをたすけにきた$$$$$
# '''

# jh = Japtohan()
# print(jh.furitohan_str(lyrics))
